[{"author":"NITROFIX","artName":"Как GPT-4o помог мне создать плагин для After Effects: экономим часы на нейминге слоев","preview":"В индустрии анимации и визуальных эффектов время — бесценный ресурс. Работая над проектами, содержащими сотни или даже тысячи слоев, переименование каждого слоя вручную превращается в изнурительную задачу, способную занять часы. Это не просто утомляет — это выбивает из творческого потока и негативно сказывается на качестве работы. Время, которое могло быть потрачено на создание анимации, уходит на приведение проекта в состояние, когда с ним «хоть как‑то можно начать работать».","tags":["Ненормальное программирование","JavaScript","Программирование","Компьютерная анимация","Дизайн"],"timeOfPublication":1726676160000,"views":42,"readingTime":7,"picURL":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/700/de1/1f8/700de11f8c6d3d7860949e6aab587516.png"},{"author":"d_m1triy","artName":"Версионирование. Автоматизация. А может всё вместе?","preview":"Всё уже придумано, просто настрой под себя и пользуйся.\nВсем привет, я Дмитрий Валеев – DevOps инженер в команде разработки фреймворка для тестирования устройств на заводах Аквариус. И это моя первая маленькая статья на Хабр :)\nВ любом проекте настаёт день “икс”, когда вы понимаете, что необходимо внедрять какое-либо версионирование. Вот и в нашем случае настал такой момент. Вариант с хэш-коммитами казался просто хаосом и нужно было привести вид компонент в порядок","tags":["Блог компании ПК Аквариусб","Git","DevOps"],"timeOfPublication":1726675560000,"views":73,"readingTime":6,"picURL":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/99a/a63/f8c/99aa63f8cd1a219c8db04db1c1d26abb.png"},{"author":"MrPizzly","artName":"Обход SSH Keystroke Obfuscation","preview":"В OpenSSH версии 9.5 были добавлены меры предотвращения keystroke timing‑атаки за счет анализа трафика. Патч включал добавление обфускации таймингов нажатий клавиш в клиенте SSH. Согласно информации о релизе, эта функция «пытается скрыть тайминги между нажатиями за счет отправки трафика взаимодействия через фиксированные интервалы времени (по умолчанию — 20 мс), когда отправляется малое количество данных». Также отправляются фейковые chaff‑пакеты после последнего нажатия, что значительно усложняет анализ трафика, скрывая реальные нажатия среди потока искусственных пакетов. Эта функция может настраиваться с помощью опции ObscureKeystrokeTiming в конфигурации SSH.\nЯ исследовал влияние использования анализа задержек между нажатиями клавиш для определения отправляемых внутри сессии SSH команд клиентом в рамках моей бакалаврской диссертации. В ходе этого я обнаружил способ обхода этого метода обфускации, работающий вплоть до текущего релиза. Я оповестил разработчиков 24 апреля и получил ответ от самого Дэмьена Миллера (разработчик, добавивший данный патч), но, к сожалению, дальнейшая переписка была проигнорирована. Отсюда и публикация данной статьи.","tags":["Блог компании Beget","Информационная безопасность"],"timeOfPublication":1726674900000,"views":96,"readingTime":10,"picURL":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/d7a/4d0/b4f/d7a4d0b4f11cfbf3496217d7e075b954.png"},{"author":"nick_oldman","artName":"Системный аналитик. Краткий гайд по профессии. Часть 3","preview":"Из этой статьи вы узнаете об основных широко используемых типах программной архитектуры, их преимуществах и недостатках, узнаете, как выбрать архитектуру и рассчитать нагрузку при проектировании домена, познакомитесь с принципами масштабирования приложений и получите знания о том, что такое CAP-теорема и уровни изоляции транзакций.\nДанный текст является обзорной статьей и преимущественно ориентирован на новичков в IT-индустрии, предназначен для желающих познакомиться с профессией, узнать о ее содержании, основных принципах, практиках и инструментах, используемых в ней.","tags":["Анализ и проектирование систем"],"timeOfPublication":1726673940000,"views":236,"readingTime":16,"picURL":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/1bb/008/1a2/1bb0081a21ceba857b1525cda18ae677.png"},{"author":"Time_Seeker","artName":"Как собрать и запустить отдел по работе с инцидентами в продакшене — разбираемся в статье-инструкции","preview":"Привет, Хабр! Я — Алексей Ткаченко, руководитель отдела L1 в диджитал-продакшене Далее. Наша команда отвечает за мониторинг работоспособности ресурсов клиентов, оперативно реагирует на проблемы и помогает с ними разбираться. Попутно облегчает жизнь клиентов и менеджеров. Расскажу, зачем бизнесу может понадобиться такой отдел, как строится работа в команде и к каким результатам мы пришли за год. ","tags":["Веб-разработка","Управление разработкой","Управление проектами","Подготовка технической документации"],"timeOfPublication":1726672740000,"views":77,"readingTime":4,"picURL":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/960/a42/959/960a4295945a5759d6ce0ad1d30e299e.png"},{"author":"denis-19","artName":"Пользователи в РФ жалуются на проблемы с доступом к Discord","preview":"18 сентября 2024 года пользователи из РФ начали массово жаловаться на проблемы с доступом к платформе Discord. У многих уже несколько часов не получается зайти в приложение ни со смартфона, ни с ПК. Также пользователи не могут залогиниться и подключиться к серверам, не видят сообщения и каналы.","tags":["IT-инфраструктура","Сетевые технологии","Облачные сервисы","Социальные сети и сообщества","Сетевое оборудование"],"timeOfPublication":1726671840000,"views":-1,"readingTime":1,"picURL":"https://habrastorage.org/r/w1560/getpro/habr/upload_files/371/80d/638/37180d6380c0852e746ab5ee0ef5d491.png"}]